import React, { useState, useEffect } from 'react';

const Footer = () => {
    const facts = [
        '枫城站始建于2019年',
        '燕原国际机场下方有一个被改造过的废弃矿井',
        '平安里站A出口附近有一个横贯整个枫城的人防地下河出入口',
		'购物中心里有枫城唯一的一架纯红石电梯和一架汽车举升电梯',
	    '枫城和虚空城可能要联动了',
	    '在修东环国际机场的换乘通道时挖到了湟谷站',
		'作者不喜欢别人催更',
	    '9号线在新宫庙站向东预留有一大段隧道和长兴预留站',
		'位于枫城东港的那艘散货船叫翻滚号',
		'你可以在2号线市管局站附近找到1号线枫城站的废弃出入口',
		'枫城才是中国版自动越行及双向无痕报站机制的首创',
		'旧机场路下方的巨大空洞甚至可以住宿',
		'榆树庄的民营火箭发射中心可以抵达月球看到玉兔',
		'业山古镇展线修改了两次，你可以找到两条废弃线路',
		'枫城作者其实在地图里面留后门了',
		'南海畔站在地面出入口和2号线换乘通道之间预留了一段通道',
		'4号线南海畔站过海方向的神秘隧道是原4号线支线预留产物（现已废弃）',
		'海悦长枫苑的售楼处给的东西不要吃',
		'在枫城早期版本，你可以在市管局的窗户上看到市民的控诉',
		'枫城大剧院举行的唯一一场表演是羊艹机表演',
		'枫城大剧院下方有一个迷宫构成的隧道',
		'业山古镇是由一个峡谷改造的',
		'枫城2020-2024间的四代欢迎大厅都在欢迎广场附近，你知道他们都是哪些建筑吗',
		'你有玩过枫城的前传吗？天枫轨道交通地铁网络',
		'在B站中观看Kenzify视频时间最长的是川E人',
		'枫城最长的轨道交通线路是8号线',
		'枫城中心医院里的太平间不要去',
		'枫城的铁路接触网高度为5格，轨道交通为4格',
		'你使用过枫城厕所里的通便神器吗？',
		'你去过枫城火车站地铁站里的隐藏房间吗？',
		'枫城2024补丁版预计9月发布',
		'枫城2024补丁版预计10月发布',
		'枫城2024补丁版预计11月发布',
		'枫城2024补丁版预计12月发布',
		'枫城2024补丁版可能不发布了',
		'枫城2025版本可能会提前发布',
		'枫城2025版本可能会延后发布',
		'在枫城火车站外存放着几节5033的车厢',
		'1号线和国铁其实有两条联络线',
		'你爱吃排骨炖海带吗',
		'枫城的图标地图画位于10000 100 100000',
		'枫城人民公园里甚至有婚礼殿堂',
		'3号线湟谷站利用岩洞做了个正经的“紧急出口”',
		'什么？？鑫居小区竟然没有厕所，建议业主到人工湖解决',
		'散货船上的货可不便宜',
		'你有见识过鑫居小区停车场中陆少的法拉利吗',
		'业山古镇竟然没有地面出入口',
		'东环国际机场消防站里的基因改造汗血宝马',
		'枫城曾经因为参与网易活动，进行过短暂的付费制',
		'你去过枫城的地狱维度吗',
		'你去过枫城的末地维度吗',
		'清风苑大学的食堂里都是硬菜',
		'枫城作者在现实中制作枫城被粉丝认出来过',
		'清风苑大学校长李晓辉是谁？（与现实人物无关）',
		'清风苑大学在规划时叫滨海大学，由于大门需要放5个字才能对称，于是改成了现在的名字',
		'西绦三中是作者的初中还原（北京市第十三中学分校）',
		'西绦三中校服是作者的初中校服还原',
		'轨道交通5号线施工时挖穿了国铁控制中心',
		'国铁控制中心的下面是什么？',
		'你知道枫城出生点附近的峡谷景区处下方是个支离破碎的要塞吗',
		'青城山火车站的地下结构神似八达岭长城站',
		'新岛火车站是枫城最大的单体建筑',
		'燕原国际机场工程是枫城最大的建筑群',
		'轨道交通8号线隧道壁为深板岩主题',
		'轨道交通8号线有两种道床样式和三种隧道样式',
    ];

    const [randomFact, setRandomFact] = useState('');

    useEffect(() => {
        generateRandomFact();
    }, []);

    const generateRandomFact = () => {
        const newFact = facts[Math.floor(Math.random() * facts.length)];
        setRandomFact(newFact);
    };

    return (
        <footer style={styles.footer}>
            <div style={styles.links}>
                <a href="https://www.xfkenzify.com:3001/" style={styles.link}>路径规划</a>
                <a href="https://www.xfkenzify.com:3010/" style={styles.link}>枫城百科</a>
                <a href="https://www.xfkenzify.com:3002/gallery-navigation" style={styles.link}>在线地图</a>
            </div>
            <div style={styles.fact} onClick={generateRandomFact}>
                你知道吗：{randomFact}
            </div>
        </footer>
    );
};

const styles = {
    footer: {
        backgroundColor: '#333',
        color: '#fff',
        padding: '20px',
        textAlign: 'center',
        marginTop: '20px',
    },
    links: {
        marginBottom: '10px',
    },
    link: {
        color: '#fff',
        margin: '0 15px',
        textDecoration: 'none',
    },
    fact: {
        fontSize: '14px',
        cursor: 'pointer', // 添加手型指针
    }
};

export default Footer;
